artillery_test/result_cluster.txt
Phase started: unnamed (index: 0, duration: 1s) 17:59:47(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 17:59:49(-0300)

--------------------------------------
Metrics for period to: 17:59:50(-0300) (width: 1.57s)
--------------------------------------

http.codes.200: ................................................................ 173
http.request_rate: ............................................................. 145/sec
http.requests: ................................................................. 223
http.response_time:
  min: ......................................................................... 50
  max: ......................................................................... 828
  median: ...................................................................... 186.8
  p95: ......................................................................... 441.5
  p99: ......................................................................... 788.5
http.responses: ................................................................ 173
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 18:00:00(-0300) (width: 9.398s)
--------------------------------------

http.codes.200: ................................................................ 1126
http.request_rate: ............................................................. 119/sec
http.requests: ................................................................. 1118
http.response_time:
  min: ......................................................................... 46
  max: ......................................................................... 2044
  median: ...................................................................... 308
  p95: ......................................................................... 925.4
  p99: ......................................................................... 1652.8
http.responses: ................................................................ 1126
vusers.completed: .............................................................. 8
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7711.8
  max: ......................................................................... 11012.1
  median: ...................................................................... 10832
  p95: ......................................................................... 11050.8
  p99: ......................................................................... 11050.8


--------------------------------------
Metrics for period to: 18:00:10(-0300) (width: 5.668s)
--------------------------------------

http.codes.200: ................................................................ 701
http.request_rate: ............................................................. 117/sec
http.requests: ................................................................. 659
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 987
  median: ...................................................................... 179.5
  p95: ......................................................................... 757.6
  p99: ......................................................................... 889.1
http.responses: ................................................................ 701
vusers.completed: .............................................................. 42
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 11499.2
  max: ......................................................................... 17456.4
  median: ...................................................................... 16819.2
  p95: ......................................................................... 17505.6
  p99: ......................................................................... 17505.6


All VUs finished. Total time: 18 seconds

--------------------------------
Summary report @ 18:00:06(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 127/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 2044
  median: ...................................................................... 237.5
  p95: ......................................................................... 854.2
  p99: ......................................................................... 1274.3
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7711.8
  max: ......................................................................... 17456.4
  median: ...................................................................... 16159.7
  p95: ......................................................................... 17505.6
  p99: ......................................................................... 17505.6