artillery_test/result_fork.txt
Phase started: unnamed (index: 0, duration: 1s) 17:55:04(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 17:55:05(-0300)

--------------------------------------
Metrics for period to: 17:55:10(-0300) (width: 5.712s)
--------------------------------------

http.codes.200: ................................................................ 560
http.request_rate: ............................................................. 107/sec
http.requests: ................................................................. 610
http.response_time:
  min: ......................................................................... 49
  max: ......................................................................... 1730
  median: ...................................................................... 354.3
  p95: ......................................................................... 713.5
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 560
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 17:55:20(-0300) (width: 9.959s)
--------------------------------------

http.codes.200: ................................................................ 1094
http.request_rate: ............................................................. 110/sec
http.requests: ................................................................. 1094
http.response_time:
  min: ......................................................................... 192
  max: ......................................................................... 1821
  median: ...................................................................... 333.7
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1176.4
http.responses: ................................................................ 1094


--------------------------------------
Metrics for period to: 17:55:30(-0300) (width: 2.536s)
--------------------------------------

http.codes.200: ................................................................ 346
http.request_rate: ............................................................. 119/sec
http.requests: ................................................................. 296
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 1092
  median: ...................................................................... 308
  p95: ......................................................................... 757.6
  p99: ......................................................................... 837.3
http.responses: ................................................................ 346
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16357.8
  max: ......................................................................... 18565.4
  median: ...................................................................... 17859.2
  p95: ......................................................................... 18220
  p99: ......................................................................... 18588.1


All VUs finished. Total time: 20 seconds

--------------------------------
Summary report @ 17:55:25(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 112/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 1821
  median: ...................................................................... 347.3
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16357.8
  max: ......................................................................... 18565.4
  median: ...................................................................... 17859.2
  p95: ......................................................................... 18220
  p99: ......................................................................... 18588.1